jaxws-ri/tests/unit/testcases/benchmark/rpclit/rpclit.wsdl

<?xml version="1.0" encoding="UTF-8"?>
<!--

    DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

    Copyright (c) 1997-2017 Oracle and/or its affiliates. All rights reserved.

    The contents of this file are subject to the terms of either the GNU
    General Public License Version 2 only ("GPL") or the Common Development
    and Distribution License("CDDL") (collectively, the "License").  You
    may not use this file except in compliance with the License.  You can
    obtain a copy of the License at
    https://oss.oracle.com/licenses/CDDL+GPL-1.1
    or LICENSE.txt.  See the License for the specific
    language governing permissions and limitations under the License.

    When distributing the software, include this License Header Notice in each
    file and include the License file at LICENSE.txt.

    GPL Classpath Exception:
    Oracle designates this particular file as subject to the "Classpath"
    exception as provided by Oracle in the GPL Version 2 section of the License
    file that accompanied this code.

    Modifications:
    If applicable, add the following below the License Header, with the fields
    enclosed by brackets [] replaced by your own identifying information:
    "Portions Copyright [year] [name of copyright owner]"

    Contributor(s):
    If you wish your version of this file to be governed by only the CDDL or
    only the GPL Version 2, indicate your decision by adding "[Contributor]
    elects to include this software in this distribution under the [CDDL or GPL
    Version 2] license."  If you don't indicate a single choice of license, a
    recipient has the option to distribute your version of this file under
    either the CDDL, the GPL Version 2 or to extend the choice of license to
    its licensees as provided above.  However, if you add GPL Version 2 code
    and therefore, elected the GPL Version 2 license, then the option applies
    only if the new code is made subject to such option by the copyright
    holder.

-->

<definitions
	xmlns="http://schemas.xmlsoap.org/wsdl/"
	xmlns:http="http://schemas.xmlsoap.org/wsdl/http/"
	xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/"
	xmlns:s="http://www.w3.org/2001/XMLSchema"
	xmlns:ns0="http://soapinterop.org/"
	targetNamespace="http://soapinterop.org/">
  <types>
    <s:schema elementFormDefault="qualified" targetNamespace="http://soapinterop.org/">
      <s:complexType name="integerArray">
        <s:sequence>
          <s:element name="value" minOccurs="0" maxOccurs="unbounded" type="s:int" nillable="false"/>
        </s:sequence>
      </s:complexType>
      <s:complexType name="floatArray">
        <s:sequence>
          <s:element name="value" minOccurs="0" maxOccurs="unbounded" type="s:float" nillable="false"/>
        </s:sequence>
      </s:complexType>
      <s:complexType name="stringArray">
        <s:sequence>
          <s:element name="value" minOccurs="0" maxOccurs="unbounded" type="s:string"/>
        </s:sequence>
      </s:complexType>
      <s:complexType name="complexTypeArray">
        <s:sequence>
          <s:element name="value" minOccurs="0" maxOccurs="unbounded" type="ns0:ComplexType"/>
        </s:sequence>
      </s:complexType>
      <s:complexType name="ComplexType">
        <s:sequence>
          <s:element minOccurs="1" maxOccurs="1" name="varInt" type="s:int"/>
          <s:element minOccurs="0" maxOccurs="1" name="varString" type="s:string"/>
          <s:element minOccurs="1" maxOccurs="1" name="varFloat" type="s:float"/>
        </s:sequence>
      </s:complexType>
      <s:complexType name="NestedComplexType">
        <s:sequence>
          <s:element minOccurs="1" maxOccurs="1" name="varString" type="s:string"/>
          <s:element minOccurs="1" maxOccurs="1" name="varInt" type="s:int"/>
          <s:element minOccurs="1" maxOccurs="1" name="varFloat" type="s:float"/>
          <s:element minOccurs="1" maxOccurs="1" name="varComplexType" type="ns0:ComplexType" nillable="true"/>
        </s:sequence>
      </s:complexType>
      <s:simpleType name="Enum">
        <s:restriction base="s:string">
          <s:enumeration value="BitOne"/>
          <s:enumeration value="BitTwo"/>
          <s:enumeration value="BitThree"/>
          <s:enumeration value="BitFour"/>
          <s:enumeration value="BitFive"/>
        </s:restriction>
      </s:simpleType>
    </s:schema>
  </types>
  <message name="echoVoid"/>
  <message name="echoVoidResponse"/>
  <message name="echoInteger">
    <part name="parameters" type="s:int"/>
  </message>
  <message name="echoIntegerResponse">
    <part name="return" type="s:int"/>
  </message>
  <message name="echoFloat">
    <part name="parameters" type="s:float"/>
  </message>
  <message name="echoFloatResponse">
    <part name="return" type="s:float"/>
  </message>
  <message name="echoString">
    <part name="parameters" type="s:string"/>
  </message>
  <message name="echoStringResponse">
    <part name="return" type="s:string"/>
  </message>
  <message name="echoBase64">
    <part name="parameters" type="s:base64Binary"/>
  </message>
  <message name="echoBase64Response">
    <part name="return" type="s:base64Binary"/>
  </message>
  <message name="echoDate">
    <part name="parameters" type="s:dateTime"/>
  </message>
  <message name="echoDateResponse">
    <part name="return" type="s:dateTime"/>
  </message>
  <message name="echoComplexType">
    <part name="parameters" type="ns0:ComplexType"/>
  </message>
  <message name="echoComplexTypeResponse">
    <part name="return" type="ns0:ComplexType"/>
  </message>
  <message name="echoIntegerArray">
    <part name="parameters" type="ns0:integerArray"/>
  </message>
  <message name="echoIntegerArrayResponse">
    <part name="return" type="ns0:integerArray"/>
  </message>
  <message name="echoFloatArray">
    <part name="parameters" type="ns0:floatArray"/>
  </message>
  <message name="echoFloatArrayResponse">
    <part name="return" type="ns0:floatArray"/>
  </message>
  <message name="echoStringArray">
    <part name="parameters" type="ns0:stringArray"/>
  </message>
  <message name="echoStringArrayResponse">
    <part name="return" type="ns0:stringArray"/>
  </message>
  <message name="echoComplexTypeArray">
    <part name="parameters" type="ns0:complexTypeArray"/>
  </message>
  <message name="echoComplexTypeArrayResponse">
    <part name="return" type="ns0:complexTypeArray"/>
  </message>
  <message name="echoDecimal">
    <part name="parameters" type="s:decimal"/>
  </message>
  <message name="echoDecimalResponse">
    <part name="return" type="s:decimal"/>
  </message>
  <message name="echoBoolean">
    <part name="parameters" type="s:boolean"/>
  </message>
  <message name="echoBooleanResponse">
    <part name="return" type="s:boolean"/>
  </message>
  <message name="echoNestedComplexType">
    <part name="parameters" type="ns0:NestedComplexType"/>
  </message>
  <message name="echoNestedComplexTypeResponse">
    <part name="return" type="ns0:NestedComplexType"/>
  </message>
  <message name="echoEnum">
    <part name="parameters" type="ns0:Enum"/>
  </message>
  <message name="echoEnumResponse">
    <part name="return" type="ns0:Enum"/>
  </message>
  <portType name="EchoPortType">
    <operation name="echoVoid">
      <input message="ns0:echoVoid"/>
      <output message="ns0:echoVoidResponse"/>
    </operation>
    <operation name="echoBoolean">
      <input message="ns0:echoBoolean"/>
      <output message="ns0:echoBooleanResponse"/>
    </operation>
    <operation name="echoInteger">
      <input message="ns0:echoInteger"/>
      <output message="ns0:echoIntegerResponse"/>
    </operation>
    <operation name="echoFloat">
      <input message="ns0:echoFloat"/>
      <output message="ns0:echoFloatResponse"/>
    </operation>
    <operation name="echoString">
      <input message="ns0:echoString"/>
      <output message="ns0:echoStringResponse"/>
    </operation>
    <operation name="echoBase64">
      <input message="ns0:echoBase64"/>
      <output message="ns0:echoBase64Response"/>
    </operation>
    <operation name="echoDate">
      <input message="ns0:echoDate"/>
      <output message="ns0:echoDateResponse"/>
    </operation>
    <operation name="echoEnum">
      <input message="ns0:echoEnum"/>
      <output message="ns0:echoEnumResponse"/>
    </operation>
    <operation name="echoDecimal">
      <input message="ns0:echoDecimal"/>
      <output message="ns0:echoDecimalResponse"/>
    </operation>
    <operation name="echoComplexType">
      <input message="ns0:echoComplexType"/>
      <output message="ns0:echoComplexTypeResponse"/>
    </operation>
    <operation name="echoIntegerArray">
      <input message="ns0:echoIntegerArray"/>
      <output message="ns0:echoIntegerArrayResponse"/>
    </operation>
    <operation name="echoFloatArray">
      <input message="ns0:echoFloatArray"/>
      <output message="ns0:echoFloatArrayResponse"/>
    </operation>
    <operation name="echoStringArray">
      <input message="ns0:echoStringArray"/>
      <output message="ns0:echoStringArrayResponse"/>
    </operation>
    <operation name="echoComplexTypeArray">
      <input message="ns0:echoComplexTypeArray"/>
      <output message="ns0:echoComplexTypeArrayResponse"/>
    </operation>
    <operation name="echoNestedComplexType">
      <input message="ns0:echoNestedComplexType"/>
      <output message="ns0:echoNestedComplexTypeResponse"/>
    </operation>
  </portType>
  <binding name="EchoBinding" type="ns0:EchoPortType">
    <soap:binding transport="http://schemas.xmlsoap.org/soap/http" style="rpc"/>
    <operation name="echoVoid">
      <soap:operation/>
      <input>
        <soap:body use="literal" namespace="http://soapinterop.org/"/>
      </input>
      <output>
        <soap:body use="literal" namespace="http://soapinterop.org/"/>
      </output>
    </operation>
    <operation name="echoInteger">
      <soap:operation/>
      <input>
        <soap:body use="literal" namespace="http://soapinterop.org/"/>
      </input>
      <output>
        <soap:body use="literal" namespace="http://soapinterop.org/"/>
      </output>
    </operation>
    <operation name="echoFloat">
      <soap:operation/>
      <input>
        <soap:body use="literal" namespace="http://soapinterop.org/"/>
      </input>
      <output>
        <soap:body use="literal" namespace="http://soapinterop.org/"/>
      </output>
    </operation>
    <operation name="echoString">
      <soap:operation/>
      <input>
        <soap:body use="literal" namespace="http://soapinterop.org/"/>
      </input>
      <output>
        <soap:body use="literal" namespace="http://soapinterop.org/"/>
      </output>
    </operation>
    <operation name="echoBase64">
      <soap:operation/>
      <input>
        <soap:body use="literal" namespace="http://soapinterop.org/"/>
      </input>
      <output>
        <soap:body use="literal" namespace="http://soapinterop.org/"/>
      </output>
    </operation>
    <operation name="echoDate">
      <soap:operation/>
      <input>
        <soap:body use="literal" namespace="http://soapinterop.org/"/>
      </input>
      <output>
        <soap:body use="literal" namespace="http://soapinterop.org/"/>
      </output>
    </operation>
    <operation name="echoDecimal">
      <soap:operation/>
      <input>
        <soap:body use="literal" namespace="http://soapinterop.org/"/>
      </input>
      <output>
        <soap:body use="literal" namespace="http://soapinterop.org/"/>
      </output>
    </operation>
    <operation name="echoBoolean">
      <soap:operation/>
      <input>
        <soap:body use="literal" namespace="http://soapinterop.org/"/>
      </input>
      <output>
        <soap:body use="literal" namespace="http://soapinterop.org/"/>
      </output>
    </operation>
    <operation name="echoComplexType">
      <soap:operation/>
      <input>
        <soap:body use="literal" namespace="http://soapinterop.org/"/>
      </input>
      <output>
        <soap:body use="literal" namespace="http://soapinterop.org/"/>
      </output>
    </operation>
    <operation name="echoEnum">
      <soap:operation/>
      <input>
        <soap:body use="literal" namespace="http://soapinterop.org/"/>
      </input>
      <output>
        <soap:body use="literal" namespace="http://soapinterop.org/"/>
      </output>
    </operation>
    <operation name="echoNestedComplexType">
      <soap:operation/>
      <input>
        <soap:body use="literal" namespace="http://soapinterop.org/"/>
      </input>
      <output>
        <soap:body use="literal" namespace="http://soapinterop.org/"/>
      </output>
    </operation>
    <operation name="echoIntegerArray">
      <soap:operation/>
      <input>
        <soap:body use="literal" namespace="http://soapinterop.org/"/>
      </input>
      <output>
        <soap:body use="literal" namespace="http://soapinterop.org/"/>
      </output>
    </operation>
    <operation name="echoFloatArray">
      <soap:operation/>
      <input>
        <soap:body use="literal" namespace="http://soapinterop.org/"/>
      </input>
      <output>
        <soap:body use="literal" namespace="http://soapinterop.org/"/>
      </output>
    </operation>
    <operation name="echoStringArray">
      <soap:operation/>
      <input>
        <soap:body use="literal" namespace="http://soapinterop.org/"/>
      </input>
      <output>
        <soap:body use="literal" namespace="http://soapinterop.org/"/>
      </output>
    </operation>
    <operation name="echoComplexTypeArray">
      <soap:operation/>
      <input>
        <soap:body use="literal" namespace="http://soapinterop.org/"/>
      </input>
      <output>
        <soap:body use="literal" namespace="http://soapinterop.org/"/>
      </output>
    </operation>
  </binding>
  <service name="EchoService">
    <port name="EchoPort" binding="ns0:EchoBinding">
      <soap:address location="REPLACE_WITH_ACTUAL_URL"/>
    </port>
  </service>
</definitions>
