interop-mock/src/main/resources/w3c/soap12-testcollection/XMLP-6-request.xml

<?xml version="1.0" ?>
<env:Envelope xmlns:env="http://www.w3.org/2003/05/soap-envelope">
  <env:Header>
    <t:element xmlns:t="http://axis.apache.org/mock/template" t:name="${headerName}" t:attributes="${headerAttributes}"
         env:mustUnderstand="1"
         env:role="http://www.w3.org/2003/05/soap-envelope/role/next"><t:value expression="${content}" type="string"/></t:element>
  </env:Header>
  <env:Body>
    <sb:echoVoid xmlns:sb="http://soapinterop.org/"
        env:encodingStyle="http://www.w3.org/2003/05/soap-encoding" />
  </env:Body>
</env:Envelope>
